package sec03.exam01_for;
// 1부터 100까지 합을 출력
public class ForSumFrom1To100Example {

	public static void main(String[] args) {
		int sum = 0;
		
		for(int i=1; i<=100; i++) {
			sum += i;
			System.out.println("1~"+(i-1)+"까지의 합 : "+sum);
		}
		
		System.out.println("1~100 합 : "+sum);
	}

}
/* 출력값
1~0까지의 합 : 1
1~1까지의 합 : 3
1~2까지의 합 : 6
1~3까지의 합 : 10
1~4까지의 합 : 15
1~5까지의 합 : 21
1~6까지의 합 : 28
1~7까지의 합 : 36
1~8까지의 합 : 45
1~9까지의 합 : 55
1~10까지의 합 : 66
1~11까지의 합 : 78
1~12까지의 합 : 91
1~13까지의 합 : 105
1~14까지의 합 : 120
1~15까지의 합 : 136
1~16까지의 합 : 153
1~17까지의 합 : 171
1~18까지의 합 : 190
1~19까지의 합 : 210
1~20까지의 합 : 231
1~21까지의 합 : 253
1~22까지의 합 : 276
1~23까지의 합 : 300
1~24까지의 합 : 325
1~25까지의 합 : 351
1~26까지의 합 : 378
1~27까지의 합 : 406
1~28까지의 합 : 435
1~29까지의 합 : 465
1~30까지의 합 : 496
1~31까지의 합 : 528
1~32까지의 합 : 561
1~33까지의 합 : 595
1~34까지의 합 : 630
1~35까지의 합 : 666
1~36까지의 합 : 703
1~37까지의 합 : 741
1~38까지의 합 : 780
1~39까지의 합 : 820
1~40까지의 합 : 861
1~41까지의 합 : 903
1~42까지의 합 : 946
1~43까지의 합 : 990
1~44까지의 합 : 1035
1~45까지의 합 : 1081
1~46까지의 합 : 1128
1~47까지의 합 : 1176
1~48까지의 합 : 1225
1~49까지의 합 : 1275
1~50까지의 합 : 1326
1~51까지의 합 : 1378
1~52까지의 합 : 1431
1~53까지의 합 : 1485
1~54까지의 합 : 1540
1~55까지의 합 : 1596
1~56까지의 합 : 1653
1~57까지의 합 : 1711
1~58까지의 합 : 1770
1~59까지의 합 : 1830
1~60까지의 합 : 1891
1~61까지의 합 : 1953
1~62까지의 합 : 2016
1~63까지의 합 : 2080
1~64까지의 합 : 2145
1~65까지의 합 : 2211
1~66까지의 합 : 2278
1~67까지의 합 : 2346
1~68까지의 합 : 2415
1~69까지의 합 : 2485
1~70까지의 합 : 2556
1~71까지의 합 : 2628
1~72까지의 합 : 2701
1~73까지의 합 : 2775
1~74까지의 합 : 2850
1~75까지의 합 : 2926
1~76까지의 합 : 3003
1~77까지의 합 : 3081
1~78까지의 합 : 3160
1~79까지의 합 : 3240
1~80까지의 합 : 3321
1~81까지의 합 : 3403
1~82까지의 합 : 3486
1~83까지의 합 : 3570
1~84까지의 합 : 3655
1~85까지의 합 : 3741
1~86까지의 합 : 3828
1~87까지의 합 : 3916
1~88까지의 합 : 4005
1~89까지의 합 : 4095
1~90까지의 합 : 4186
1~91까지의 합 : 4278
1~92까지의 합 : 4371
1~93까지의 합 : 4465
1~94까지의 합 : 4560
1~95까지의 합 : 4656
1~96까지의 합 : 4753
1~97까지의 합 : 4851
1~98까지의 합 : 4950
1~99까지의 합 : 5050
1~100 합 : 5050
*/